<!-- 现在因为接口问题没有拿到数据所以这些地方都是死数据 , 后期可以再替换 -->
<template>
    <div class="step1">
        <!-- 上面医院信息部分 -->
        <div class="top">
            <!-- 标题信息区域 -->
            <div class="title">
                <div class="hosName">{{ hospitalWorkData.baseMap?.hosname }}</div>
                <div class="line"></div>
                <div class="department">{{ hospitalWorkData.baseMap?.bigname }}</div>
                <div class="dot">.</div>
                <div class="outpatientName">{{ hospitalWorkData.baseMap?.depname }}</div>
            </div>
            <!-- 挂号信息区域 -->
            <div class="registeredMsg">
                <div class="time">{{ hospitalWorkData.baseMap?.workDateString }}</div>
                <div class="registeredBox">
                    <div class="item" @click="getDoctorInfo($event, item.workDate)"
                        :class="{ active: item.status == -1 || item.availableNumber == -1 }"
                        v-for="(item, index) in hospitalWorkData?.bookingScheduleList" :key="index">
                        <div class="regTop">{{ item.workDate }}-{{ item.dayOfWeek }}</div>
                        <div class="regBottom">
                            <div v-if="item.status == -1">停止挂号</div>
                            <div v-if="item.status == 0">{{ item.availableNumber == -1 ? '无号' :
                                `有号(${item.availableNumber})` }}
                            </div>
                            <div v-if="item.status == 1">即将放号</div>
                        </div>
                    </div>
                </div>
            </div>
            <!-- 分页器区域 -->
            <div class="pagination">
                <el-pagination layout="prev, pager, next" v-model:current-page="pageNo" :total="hospitalWorkData?.total"
                    @current-change="getBookingInfo(pageNo)" />
            </div>
        </div>
        <!-- 展示医生信息的区域 -->
        <div class="bottom">
            <!-- 展示即将放号的区域 (2选1) -->
            <!-- 这里应该是 v-if="time === 1" 但是由于没有数据所以暂时 === 0-->
            <div class="putTheNumber" v-if="0">放号时间:{{ docInfo[0]?.workDate }}</div>
            <!-- 展示上午和下午号源的区域  (2选1) -->
            <div class="numberSource" v-else>
                <div class="morning">
                    <div class="morningTitle">
                        <svg t="1692625587129" class="icon" viewBox="0 0 1024 1024" version="1.1"
                            xmlns="http://www.w3.org/2000/svg" p-id="5140" width="32" height="32">
                            <path
                                d="M752.41931153 240.7063601c8.36993432 0 15.62255883 3.08990502 21.72821045 9.16589356 6.1353147 6.08093262 9.18566918 13.3928833 9.18566918 21.73315382 0 8.55285621-3.05035376 15.85986352-9.18566918 21.94079614l-43.67394996 43.66900658c-5.93261719 5.97216773-13.17041016 8.95825195-21.72326709 8.95825195-8.87420678 0-16.20098901-2.98608422-22.08911085-8.75061035-5.88317847-5.87329102-8.80004906-13.2890625-8.80004906-22.14843774 0-8.54791283 2.95642114-15.75604272 8.91375732-21.72821044l43.66900659-43.67394996c6.14025879-6.07598853 13.44726539-9.16589356 21.98034668-9.16589356z m37.66223167 240.39459181h61.79809547c8.52813721 0 15.82031227 2.98608422 21.83697534 9.06207276C879.78271508 496.24395728 882.78857422 503.45208717 882.78857422 512c0 8.55285621-3.00585914 15.85986352-9.07196021 21.83697533-6.01666236 6.07598853-13.30883813 9.06207276-21.83697534 9.06207276h-61.79809547c-8.52813721 0-15.80053734-2.98608422-21.86663841-9.06207276-6.01666236-5.97711182-9.05712867-13.2890625-9.05712867-21.83697533 0-8.55285621 3.04046631-15.76098609 9.05712867-21.83697533 6.06610107-6.07598853 13.33850122-9.06207276 21.86663841-9.06207276zM512 141.21142578c8.52813721 0 15.79064917 3.08990502 21.85180688 9.06207276 6.02160645 6.08093262 9.05712867 13.3928833 9.05712867 21.83697533v61.79809546c0 8.55285621-3.03552222 15.85986352-9.0521853 21.83697534-6.06610107 6.07598853-13.32861305 9.16589356-21.85675025 9.16589355-8.53802467 0-15.80053734-3.08990502-21.86663842-9.16589355-6.01666236-5.97711182-9.0521853-13.2890625-9.05218458-21.83697534V172.11047387c0-8.44409203 3.03552222-15.76098609 9.05218458-21.83697533C496.20440674 144.3013308 503.46691871 141.21142578 512.00494408 141.21142578zM271.81304907 240.7063601c8.36499023 0 15.61267066 3.08990502 21.743042 9.16589356l43.66900659 43.67394996c6.14025879 6.07598853 9.17083764 13.38793922 9.17083764 21.72821044 0 8.55285621-3.01080323 15.86480689-9.05712938 21.83697534-6.03149391 6.08093262-13.30389404 9.06207276-21.85180617 9.06207275-8.69622827 0-16.02795386-2.98608422-21.95068359-8.85443115l-43.68383814-43.67395068c-5.97216773-5.97216773-8.92858886-13.28411842-8.92858886-22.03967284 0-8.55285621 3.00585914-15.76098609 9.07196021-21.83697462 6.01666236-5.97216773 13.30883813-9.06207276 21.85675096-9.06207276h-0.03955126z m436.93725586 436.91253615c8.36499023 0 15.60772729 2.98608422 21.72326709 9.16589355l43.67394995 43.67395067c6.1353147 6.17980933 9.18566918 13.38793922 9.18566919 21.93585205 0 8.34521461-3.05035376 15.65716529-9.18566919 21.73315382-6.1105957 6.17980933-13.35827613 9.16589356-21.72326636 9.16589356-8.52813721 0-15.84008789-2.98608422-21.98034668-9.16589356l-43.66900659-43.66900587c-5.95733618-5.87329102-8.91375732-13.1852417-8.91375732-21.73315453 0-8.55285621 3.01080323-15.86480689 9.05712866-21.94079614 6.03149391-6.07598853 13.32861305-9.16589356 21.85180689-9.16589355h-0.01977564zM512.00494408 388.40380836c-34.12243628 0-63.22192359 12.05310035-87.39239525 36.2532351-24.1358645 24.10125732-36.21368384 53.25018335-36.21368384 87.34295654 0 34.0927732 12.07782007 63.24169922 36.21368384 87.44677734C448.78796387 623.53814721 477.88250709 635.59619164 512 635.59619164c34.12243628 0 63.23181176-12.05310035 87.4072268-36.15435838C623.51837158 575.2466433 635.59619164 546.09771729 635.59619164 512c0-34.0927732-12.07782007-63.24169922-36.18896484-87.34295654C575.23181176 400.45690942 546.12243628 388.40380836 512 388.40380836zM172.12036133 481.10095191h61.79809547c8.53802467 0 15.80053734 2.98608422 21.86663841 9.06207276 6.01666236 6.08093262 9.05712867 13.2890625 9.05712867 21.83697533 0 8.55285621-3.04046631 15.85986352-9.05712867 21.83697533-6.06610107 6.07598853-13.32861305 9.06207276-21.86663841 9.06207276h-61.79809547c-8.52813721 0-15.81042481-2.98608422-21.83697534-9.06207276C144.21728492 527.85986352 141.21142578 520.54791283 141.21142578 512c0-8.55285621 3.00585914-15.76098609 9.07196021-21.83697533 6.03149391-6.07598853 13.30883813-9.06207276 21.83697534-9.06207276zM512.00494408 759.19238258c8.52813721 0 15.79064917 2.98608422 21.85180617 9.06207274 6.02160645 6.08093262 9.05712867 13.2890625 9.05712938 21.83697535v61.79809546c0 8.55285621-3.03552222 15.85986352-9.0521853 21.83697533C527.79559326 879.80249 520.53308129 882.78857422 512 882.78857422c-8.53802467 0-15.80053734-2.98608422-21.86663842-9.06207276-6.01666236-5.97711182-9.0521853-13.2890625-9.05218458-21.83697533v-61.79809546c0-8.55285621 3.03552222-15.76098609 9.05218458-21.83697534 6.06610107-6.07598853 13.32861305-9.06207276 21.86663842-9.06207275z m-196.47839379-81.57348633c8.5034182 0 15.80053734 2.98608422 21.84686279 9.16589355 6.03149391 6.08093262 9.07196021 13.3928833 9.07196021 21.94079614 0 8.44409203-3.08001685 15.65222192-9.19555664 21.72821044l-43.67394995 43.67394996c-6.10565162 6.17980933-13.34838867 9.16589356-21.72326637 9.16589356-8.54791283 0-15.84008789-2.98608422-21.85180687-8.96319533-6.07104516-6.07598853-9.0769043-13.38793922-9.0769043-21.93585205 0-8.65173364 2.95642114-15.96862769 8.92858887-21.94079614l43.68383813-43.66900658c6.10565162-6.17980933 13.44232202-9.16589356 21.95068359-9.16589355h0.03955054zM512 326.60571289c33.628052 0 64.6506958 8.34521461 93.0481565 24.81811547 28.42712378 16.69042992 50.92163109 39.1404419 67.4637456 67.56756568 16.57177758 28.32824708 24.86755347 59.32617188 24.86755347 93.00860596 0 33.68243408-8.27600098 64.68035888-24.86755347 93.10748267-16.58166504 28.32824708-39.08605981 50.77825904-67.4637456 67.4637456-28.36285424 16.58166504-59.37561059 24.82305884-93.0481565 24.82305884-33.66760254 0-64.67047143-8.24139381-93.05804468-24.81811547-28.37768578-16.69042992-50.86230492-39.14538598-67.46374487-67.46868897-16.58166504-28.42712378-24.86755347-59.42504859-24.86755348-93.10748267 0-33.68243408 8.31555152-64.68035888 24.86755348-93.00860596 16.55200195-28.42712378 39.03662109-50.87713647 67.46374487-67.56262231C447.35424828 334.94598413 478.371948 326.60571289 512 326.60571289z"
                                p-id="5141" fill="#1296db"></path>
                        </svg>
                        <p>上午号源</p>
                    </div>
                    <div class="content" v-for="item in morningDocArr" :key="item.id">
                        <div class="left">
                            <div class="physician">
                                <span>{{ item.title }}</span>
                                <svg t="1692626761712" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="14184" width="16" height="16">
                                    <path
                                        d="M512 85.333c23.573 0 42.667 20.118 42.667 44.907v763.52c0 24.79-19.094 44.907-42.667 44.907s-42.667-20.118-42.667-44.907V130.24c0-24.79 19.094-44.907 42.667-44.907z"
                                        p-id="14185" fill="#1296db"></path>
                                </svg>
                                <span>{{ item.docname }}</span>
                            </div>
                            <div class="sickness">{{ item.skill }}</div>
                        </div>
                        <div class="right">
                            <div class="price"><span>￥</span>{{ item.amount }}</div>
                            <el-button type="primary" @click="goStep2(item.id)">剩余({{ item.availableNumber }})</el-button>
                        </div>
                    </div>
                </div>
                <div class="afternoon">
                    <div class="afternoonTitle">
                        <svg t="1692625861405" class="icon" viewBox="0 0 1024 1024" version="1.1"
                            xmlns="http://www.w3.org/2000/svg" p-id="11581" width="32" height="32">
                            <path
                                d="M318.517895 617.633684h-43.385263a26.947368 26.947368 0 0 0 0 53.894737h473.734736a26.947368 26.947368 0 0 0 0-53.894737h-43.385263a217.734737 217.734737 0 1 0-411.486316-99.435789 215.578947 215.578947 0 0 0 24.522106 99.435789zM512 354.357895a163.570526 163.570526 0 0 1 129.886316 263.275789h-260.042105a161.684211 161.684211 0 0 1-33.684211-99.435789A164.109474 164.109474 0 0 1 512 354.357895zM512 269.473684a26.947368 26.947368 0 0 0 26.947368-26.947368V163.84a26.947368 26.947368 0 0 0-53.894736 0V242.526316a26.947368 26.947368 0 0 0 26.947368 26.947368zM296.421053 341.692632a26.947368 26.947368 0 0 0 37.995789-37.99579l-53.894737-53.894737A26.947368 26.947368 0 0 0 242.526316 286.72zM262.197895 518.197895a26.947368 26.947368 0 0 0-26.947369-26.947369H157.642105a26.947368 26.947368 0 1 0 0 53.894737h77.608421a26.947368 26.947368 0 0 0 26.947369-26.947368zM866.357895 491.250526h-77.608421a26.947368 26.947368 0 0 0 0 53.894737h77.608421a26.947368 26.947368 0 0 0 0-53.894737zM707.637895 350.315789a26.947368 26.947368 0 0 0 19.941052-8.623157l53.894737-53.894737a26.947368 26.947368 0 0 0-37.995789-37.99579l-53.894737 53.894737a26.947368 26.947368 0 0 0 18.054737 46.618947zM563.738947 752.370526a26.947368 26.947368 0 0 0-26.947368-26.947368H194.290526a26.947368 26.947368 0 1 0 0 53.894737h342.501053a26.947368 26.947368 0 0 0 26.947368-26.947369zM833.212632 725.423158h-199.410527a26.947368 26.947368 0 0 0 0 53.894737h199.410527a26.947368 26.947368 0 0 0 0-53.894737zM748.867368 833.212632H275.132632a26.947368 26.947368 0 0 0 0 53.894736h473.734736a26.947368 26.947368 0 0 0 0-53.894736z"
                                fill="#1296db" p-id="11582"></path>
                        </svg>
                        <p>下午号源</p>
                    </div>
                    <div class="content" v-for="item in afternoonDocArr" :key="item.id">
                        <div class="left">
                            <div class="physician">
                                <span>{{ item.title }}</span>
                                <svg t="1692626761712" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="14184" width="16" height="16">
                                    <path
                                        d="M512 85.333c23.573 0 42.667 20.118 42.667 44.907v763.52c0 24.79-19.094 44.907-42.667 44.907s-42.667-20.118-42.667-44.907V130.24c0-24.79 19.094-44.907 42.667-44.907z"
                                        p-id="14185" fill="#1296db"></path>
                                </svg>
                                <span>{{ item.docname }}</span>
                            </div>
                            <div class="sickness">{{ item.skill }}</div>
                        </div>
                        <div class="right">
                            <div class="price"><span>￥</span>{{ item.amount }}</div>
                            <!-- 这里的按钮点击事件本应该要带医生的id 但是由于上面没有数据 导致下面也没办法拿到医生的id -->
                            <el-button type="primary" @click="goStep2(item.id)">剩余({{ item.availableNumber }})</el-button>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script setup lang="ts">
// 当前组件一挂载就拿挂号数据并展示 并且在切换页面时还要再拿数据
import { onMounted, ref, computed } from 'vue';
import axios from '../../../utils/request'
import { useRoute, useRouter } from 'vue-router'
// 创建路由对象
let $route = useRoute()
// 创建路由器对象
let $router = useRouter()
// 当前页码 默认为 1  
let pageNo = ref<number>(1)
// 几条数据 默认为 6
let limit = ref<number>(6)
// 用于存储医院可预约排版数据
let hospitalWorkData = ref<any>({})
// 存储第一天的数据 默认展示第一天的排班数据
let workTime: any = ref([])
// 用于存储根据医院编号 科室编号 工作时间拿到的医生数据
let docInfo = ref<any>([])

// 过滤医院数据的数组 拆分成上午数组
let morningDocArr = computed(() => {
    return docInfo.value.filter((item: any) => item.workTime == 0)
})
// 过滤医院数据的数组 拆分成下午数组
let afternoonDocArr = computed(() => {
    return docInfo.value.filter((item: any) => item.workTime == 1)
})

// 组件挂载完毕就拿一次数据
onMounted(() => {
    getHospitalWorkData()
})
// 获取医院挂号信息的函数
let getHospitalWorkData = () => {
    axios.get(`/api/hosp/hospital/auth/getBookingScheduleRule/${pageNo.value}/${limit.value}/${$route.query.hoscode}/${$route.query.depcode}`).then((res: any) => {
        if (res.code == 200) {
            hospitalWorkData.value = res.data
            workTime.value = res.data.bookingScheduleList[0].workDate
            axios.get(`/api/hosp/hospital/auth/findScheduleList/${$route.query.hoscode}/${$route.query.depcode}/${workTime.value}`).then((res: any) => {
                if (res.code == 200) {
                    docInfo.value = res.data
                }
            })
        }
    })
}
// 点击分页器的时候也要
const getBookingInfo = (page: number) => {
    pageNo.value = page
    getHospitalWorkData()
}

//  点击挂号信息区域的回调 要改变样式且拿到数据发请求获取医生的数据
const getDoctorInfo = (e: any, workDate: string) => {
    // 点击时添加一个类用于样式美化
    let itemArr = document.querySelectorAll('.item')
    itemArr.forEach((item) => {
        item.classList.remove('bigger')
        if (item === e.currentTarget) {
            item.classList.add('bigger')
        }
    })
    // 发请求拿到医生的数据 需要医院编号 科室编号以及挂号时间 参数
    axios.get(`/api/hosp/hospital/auth/findScheduleList/${$route.query.hoscode}/${$route.query.depcode}/${workDate}`).then((res: any) => {
        if (res.code == 200) {
            docInfo.value = res.data
        }
    })
}

// 点击挂号按钮 进行路由跳转并携带 医生id
const goStep2 = (docId:string) => {
    $router.push({ path: '/hospital/step2',query:{docId} })
}
</script>

<style scoped lang="scss">
// 因为上午号源的结果和下午号源一样所以把 公告的样式提取出来放外面
.content {
    display: flex;
    justify-content: space-between;
    border-bottom: 1px solid #7f7f7f;
    padding-bottom: 30px;
    margin-bottom: 30px;

    .left {
        .physician {
            display: flex;
            margin-bottom: 30px;
            color: skyblue;
        }

        .sickness {
            font-size: 15px;
        }
    }

    .right {
        display: flex;
        align-items: center;

        ::v-deep(.el-button--primary) {
            margin-left: 40px;
        }
    }
}

// 点击方法的公共样式类名
.bigger {
    transition: all .3s;
    transform: scale(1.1);
    border: 2px solid rgb(82, 195, 240);
}

.step1 {
    .top {
        .title {
            display: flex;
            color: #7f7f7f;
            font-size: 18px;

            .line {
                width: 2px;
                height: 20px;
                background-color: rgba(0, 255, 255, 0.411);
                margin: 0 5px;
            }

            .dot {
                margin: 0 5px;
            }
        }

        .registeredMsg {
            margin: 50px 0;

            .time {
                text-align: center;
                font-size: 17px;
                font-weight: 900;
            }

            .registeredBox {
                display: flex;
                justify-content: space-between;
                margin: 40px 0;

                .item {
                    width: 150px;
                    height: 95px;
                    text-align: center;
                    border: 1px solid rgb(82, 195, 240);

                    &.active {
                        border: 1px solid #ccc;
                        color: #7f7f7f;

                        .regTop {
                            background-color: #ccc;
                        }
                    }

                    .regTop {
                        background-color: rgb(158, 211, 231);
                        line-height: 25px;
                    }

                    .regBottom {
                        line-height: 70px;
                    }
                }
            }
        }

        .pagination {
            width: 100%;
            display: flex;
            justify-content: center;
            align-items: center;
        }
    }

    .bottom {
        .numberSource {
            .morning {
                .morningTitle {
                    display: flex;
                    margin: 30px 0;

                    p {
                        text-align: center;
                        line-height: 32px;
                    }
                }

            }

            .afternoon {
                .afternoonTitle {
                    display: flex;
                    margin: 30px 0;

                    p {
                        text-align: center;
                        line-height: 32px;
                    }
                }

            }
        }

        .putTheNumber {
            color: skyblue;
            font-weight: 900;
            font-size: 22px;
            text-align: center;
            margin-top: 50px;
        }
    }
}
</style>
